In this project, we'll work with data from the CIA World Factbook, a compendium of statistics about all of the countries on Earth. The Factbook contains demographic information like population, population_growth, Area

Intro. for preparation of Connection to factbook.db

In [10]:
import sqlite3
import pandas as pd
conn = sqlite3.Connection('factbook.db')

cursor = conn.cursor()
#cursor.execute(q1).fetchall()

q= "select * FROM sqlite_master WHERE type='table';"
pd.read_sql_query(q, conn)
#cursor.execute(q).fetchmany(5)

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

In [11]:
q2 = "select * from facts limit 5"
pd.read_sql_query(q2, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46

Summary Statistics

In [15]:
q3= "select min(population) minmum_pop, max(population) maximum_pop, min(population_growth) min_pop_growth, max(population_growth) max_pop_growth from facts" 
pd.read_sql_query(q3, conn)

   minmum_pop  maximum_pop  min_pop_growth  max_pop_growth
0           0   7256490011             0.0            4.02

Outliers

In [20]:
q4="select * from facts where population == (select min(population) from facts);"
pd.read_sql_query(q4, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,250,ay,Antarctica,None,280000,None,0,None,None,None,None

In [22]:
q5="select * from facts where population == (select max(population) from facts);"
pd.read_sql_query(q5, conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,261,xx,World,None,None,None,7256490011,1.08,18.6,7.8,None

histogram

In [25]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

fig = plt.figure(figsize=(10,10))
ax = fig.add_subplot(111)

q6= "select population, population_growth, birth_rate, death_rate from factswhere population != (select max(population) from facts)
and population != (select min(population) from facts);"
pd.read_sql_query(q6, conn).hist(ax=ax)

SyntaxError: EOL while scanning string literal (<ipython-input-25-79dc1c1bcb57>, line 8)